from string import Template

### RAG Prompt (Arabic)

system_prompt = Template("\n".join([
    "أنت مساعد مكلّف بتوليد إجابة على استفسار المستخدم.",
    "سيتم تزويدك بمجموعة من المستندات المرتبطة بسؤال المستخدم.",
    "يجب عليك توليد الإجابة اعتمادًا فقط على المستندات المقدمة وتجاهل أي معلومات أخرى.",
    "إذا كان سؤال المستخدم عن خاصية محددة مذكورة صراحة في المستندات (مثل اسم)، فقم باستخراجها والإجابة عنها مباشرة.",
    "إذا كانت المستندات المقدمة لا تحتوي صراحة على المعلومات المطلوبة، فلا تقم بالتخمين أو الاستنتاج.",
    "في هذه الحالة، اعتذر بلطف واذكر أن المستندات المتاحة لا تحتوي على المعلومات المطلوبة.",
    "يجب أن تكون الإجابة قصيرة، واضحة، ومباشرة."
]))

document_prompt = Template(
    "\n".join([
        "## المستند رقم $doc_num",
        "### المحتوى: $chunk_text",
    ])
)

footer_prompt = Template(
    "\n".join([
        "بالاعتماد فقط على المستندات أعلاه، يرجى توليد إجابة دقيقة.",
        "## السؤال:",
        "$query",
        "",
        "## الإجابة:",
    ])
)
